snlkuharlocal/src/Documents/ЗаданиеНаАгрегацию/ЗаданиеНаАгрегацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаАгрегацию</name>
  <attributes>
    <name>ТипКороба</name>
    <type>
      <types>CatalogRef.ТипыКоробов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистыСозданы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегацииЗаполнены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНоменклатурыСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>600</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольнаяКоробка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СодержимоеБлочка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>id_Блочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БлочкиВсего</name>
    <attributes>
      <name>id_Блочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыУпаковок/ТипыУпаковок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУпаковок</name>
  <enumValues>
    <name>МаркированныйТовар</name>
  </enumValues>
  <enumValues>
    <name>МонотоварнаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>МультитоварнаяУпаковка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ЗаданиеНаАгрегацию/ManagerModule.bsl
Функция НайтиСоздатьЗНАПоНакладнойИСтруктуреПараметров (Знач Накладная,СтруктураПараметров)  экспорт  
	
	СтруктураВозврата 	 = новый Структура("Успех,Ошибки,Данные",Ложь,новый Массив,Неопределено);  
	//++Данилова Е.В. 27.04.2026  SNL-202
	ПроверятьКороб = Истина; 
	Если СтруктураПараметров.Свойство("НеПроверятьКороб") 
		И СтруктураПараметров.НеПроверятьКороб Тогда
		ПроверятьКороб = Ложь; 
	КонецЕсли; 
	//--Данилова Е.В. 27.04.2026 
	если не СтруктураПараметров.Свойство("ТипКороба") тогда  
		СтруктураВозврата.Ошибки.добавить("Пустой тип короба");
		//++Данилова Е.В. 27.04.2026  SNL-202
		//ИначеЕсли 	не ЗначениеЗаполнено(СтруктураПараметров.ТипКороба) тогда
	ИначеЕсли ПроверятьКороб	
		И не ЗначениеЗаполнено(СтруктураПараметров.ТипКороба) тогда 
		//--Данилова Е.В. 27.04.2026
		СтруктураВозврата.Ошибки.добавить("Пустой тип короба");	
	КонецЕсли; 
	
	если не СтруктураПараметров.Свойство("Товары")  тогда  
		СтруктураВозврата.Ошибки.добавить("Пустая таблица номенклатуры");	
	КонецЕсли;      
	
	
	если не СтруктураПараметров.Свойство("КоличествоКоробок") тогда  
		СтруктураВозврата.Ошибки.добавить("Пустое количество коробок");	
	КонецЕсли;
	
	если СтруктураВозврата.Ошибки.количество()>0 тогда
		возврат СтруктураВозврата;
	КонецЕсли;
	//++Данилова Е.В. 29.08.2025  HELP-6414 
	НеРазворачиватьКП = Ложь; 
	Если СтруктураПараметров.Свойство("НеРазворачиватьКП") Тогда
	
		НеРазворачиватьКП = СтруктураПараметров.НеРазворачиватьКП; 	
	
	КонецЕсли;
	//--Данилова Е.В. 29.08.2025
	ОтгрузкаКомплектов = ПолучитьРеквизитШапки(Накладная,"ОтгрузкаКомплектов","Документ");
	если ОтгрузкаКомплектов 
		//++Данилова Е.В. 29.08.2025  HELP-6414
		И НЕ НеРазворачиватьКП  
		//--Данилова Е.В. 29.08.2025
		тогда
		СтруктураПараметров.Товары = РазвернутьТоварыВКомплектующие(Накладная, СтруктураПараметров.Товары);
	КонецЕсли;
	
	
	ТипКороба = СтруктураПараметров.ТипКороба;
	
	ТаблицаНоменклатуры  = СтруктураПараметров.Товары;      
	если ТаблицаНоменклатуры.Количество() = 0 тогда 
		СтруктураВозврата.Ошибки.добавить("Пустая таблица номенклатура");
		возврат СтруктураВозврата;
	КонецЕсли;
	КоличествоКоробок	 = СтруктураПараметров.КоличествоКоробок;
	
	ОписаниеНоменклатурыСтрокой = СгенерироватьНоменклатурноеОписаниеЗадание(ТаблицаНоменклатуры);
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданиеНаАгрегацию.Ссылка КАК ЗНА
	               |ИЗ
	               |	Документ.ЗаданиеНаАгрегацию КАК ЗаданиеНаАгрегацию
	               |ГДЕ
	               |	ЗаданиеНаАгрегацию.Проведен
	               |	И ЗаданиеНаАгрегацию.ТипКороба = &ТипКороба
	               |	И ЗаданиеНаАгрегацию.ДокОснование = &Накладная  
				   //++Данилова Е.В. 27.04.2026 SNL-202
				  // |    И ЗаданиеНаАгрегацию.ОписаниеНоменклатурыСтрокой = &ОписаниеНоменклатурыСтрокой
	               |	И ВЫБОР
	               |			КОГДА &ПроверятьКороб
	               |				ТОГДА ЗаданиеНаАгрегацию.ОписаниеНоменклатурыСтрокой = &ОписаниеНоменклатурыСтрокой
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
				  //--Данилова Е.В. 27.04.2026 
	запрос.УстановитьПараметр("ТипКороба",ТипКороба);
	запрос.УстановитьПараметр("Накладная",Накладная); 
	запрос.УстановитьПараметр("ОписаниеНоменклатурыСтрокой",ОписаниеНоменклатурыСтрокой);
	//++Данилова Е.В. 27.04.2026 SNL-202 
	запрос.УстановитьПараметр("ПроверятьКороб",ПроверятьКороб);
	//--Данилова Е.В. 27.04.2026
	Выборка = запрос.Выполнить().Выбрать();   
	ЗНА = Неопределено;
	пока выборка.Следующий() цикл  
		ЗНА = Выборка.ЗНА;
	КонецЦикла;
	
	если ЗНА = Неопределено тогда
		ЗНАОбъект = документы.ЗаданиеНаАгрегацию.СоздатьДокумент();   
	Иначе
		ЗНАОбъект = ЗНА.ПолучитьОбъект();
		ЗНАОбъект.Товары.Очистить(); 
		//++Данилова Е.В. 29.08.2025 HELP-6414 
		ЗНАОбъект.СодержимоеБлочка.Очистить();
		ЗНАОбъект.БлочкиВсего.Очистить();
		//--Данилова Е.В. 29.08.2025
	КонецЕсли;
	
	ЗНАОбъект.ОбработкаЗаполнения(Накладная,"",Истина);   
	ЗНАОбъект.КоличествоКоробок  = КоличествоКоробок;
	ЗНАОбъект.ТипКороба			 = ТипКороба;
	
	
	для каждого СтрокаНоменклатуры из ТаблицаНоменклатуры цикл   
		СтрТЧ = ЗНАОбъект.Товары.Добавить();     
		ЗаполнитьЗначенияСвойств(СтрТЧ,СтрокаНоменклатуры);
		
	КонецЦикла;
	//++Данилова Е.В. 29.08.2025  HELP-6414 
	Если СтруктураПараметров.Свойство("СодержимоеБлочка") Тогда 
		
		СодержимоеБлочкаТЗ = СтруктураПараметров.СодержимоеБлочка;		 
	    ЗНАОбъект.СодержимоеБлочка.Загрузить(СодержимоеБлочкаТЗ); 
		
	КонецЕсли;
	
    Если СтруктураПараметров.Свойство("БлочкиВсего") Тогда 
		
		БлочкиВсегоТЗ = СтруктураПараметров.БлочкиВсего;		 
	    ЗНАОбъект.БлочкиВсего.Загрузить(БлочкиВсегоТЗ); 
		
	КонецЕсли;
	//--Данилова Е.В. 29.08.2025
	
	ЗНАОбъект.Проведен = Истина; 
	//++Данилова Е.В. 27.04.2026 SNL-202 
	Если НЕ ПроверятьКороб Тогда
	
		ЗНАОбъект.ПроизвольнаяКоробка = истина; 	
	
	КонецЕсли;
	//--Данилова Е.В. 27.04.2026 
	попытка 
		//++Данилова Е.В. 27.04.2026 SNL-202 
		ЗНАОбъект.ДополнительныеСвойства.Вставить("ПроверятьКороб",ПроверятьКороб); 
		//--Данилова Е.В. 27.04.2026 
		ЗНАОбъект.Записать();   
		ЗНА = ЗНАОбъект.Ссылка;
	Исключение                 
		ТекстОшибки = "Не удалось записать ЗНА. "+ОписаниеОшибки();
		СтруктураВозврата.Ошибки.добавить(ТекстОшибки);			
	КонецПопытки;        
	
	если СтруктураВозврата.Ошибки.количество()=0 тогда
		СтруктураВозврата.Данные = ЗНА;
		СтруктураВозврата.Успех	 = Истина; 
	КонецЕсли;
	
	возврат СтруктураВозврата;
	
КонецФункции

Функция РазвернутьТоварыВКомплектующие (Знач Накладная,Знач Товары)  
	ТоварыВозвращаемые = Товары.Скопировать();
	ТоварыВозвращаемые.Очистить();

	Запрос = новый запрос;
	запрос.Текст ="ВЫБРАТЬ
	              |	РасходнаяНакладнаяКомплектующие.Номенклатура КАК Номенклатура,
	              |	РасходнаяНакладнаяКомплектующие.Продукция КАК Продукция,
	              |	РасходнаяНакладнаяКомплектующие.Количество КАК Количество,
	              |	РасходнаяНакладнаяКомплектующие.КоличествоПродукции КАК КоличествоПродукции
	              |ИЗ
	              |	Документ.РасходнаяНакладная.Комплектующие КАК РасходнаяНакладнаяКомплектующие
	              |ГДЕ
	              |	РасходнаяНакладнаяКомплектующие.Ссылка = &Накладная
	              |	И РасходнаяНакладнаяКомплектующие.Количество > 0
	              |	И РасходнаяНакладнаяКомплектующие.Номенклатура.Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)";
	запрос.УстановитьПараметр("Накладная",Накладная);      
	ТаблицаНакладной = запрос.Выполнить().Выгрузить();
	Для каждого СтрТЗ из Товары цикл 
		МассивСтрок = ТаблицаНакладной.НайтиСтроки(Новый Структура("Продукция",СтрТЗ.Номенклатура));
		КоличествоПродукции = 0;       
		
		Для каждого СтрМасс из МассивСтрок цикл    
			КоличествоПродукции = КоличествоПродукции + СтрМасс.КоличествоПродукции; 
		КонецЦикла;  
		если КоличествоПродукции = 0 тогда Продолжить; КонецЕсли;
		
		Для каждого СтрМасс из МассивСтрок цикл    
			СтрТЗВозвращаемая = ТоварыВозвращаемые.Добавить();  
			СтрТЗВозвращаемая.Номенклатура = СтрМасс.Номенклатура;
			СтрТЗВозвращаемая.Количество = Окр(СтрТЗ.Количество*(СтрМасс.Количество/КоличествоПродукции),0); 
		КонецЦикла; 		
		
	КонецЦикла;
	
	возврат ТоварыВозвращаемые;
КонецФункции


Функция ЗаполнитьЛистыПереукладкиПоЗНА (Знач ЗаданиеНаАгрегацию,Знач ДобавлятьКСуществующим = ложь)  Экспорт        
	если ложь тогда ЗаданиеНаАгрегацию = документы.ЗаданиеНаАгрегацию.НайтиПоНомеру("");КонецЕсли;
	
	СтруктураВозврата = новый Структура("Успех,Ошибки",Истина,новый Массив);
	
	ТаблицаЛистов = ПолучитьТекущиеЛистыПереукладкиПоЗНА(ЗаданиеНаАгрегацию);
	КоличествоСуществующихЛистов = ТаблицаЛистов.количество();  	
	
	СтруктураДанныхЗНА = ПолучитьРеквизитыШапки(ЗаданиеНаАгрегацию,"АгрегацииЗаполнены,ДокОснование,Ссылка,ТипКороба,ТипКороба.Объем,КоличествоКоробок,ЛистыСозданы"); 	       
	СтруктураДанныхЗНА.Вставить("ДобавлятьКСуществующим",ДобавлятьКСуществующим);	
	СтруктураДанныхЗНА.Вставить("Товары",ПолучитьТоварыЗНА(ЗаданиеНаАгрегацию));
	СтруктураДанныхЗНА.Вставить("ДобавлятьКСуществующим",ДобавлятьКСуществующим);		
	СтруктураДанныхЗНА.Вставить("КоличествоСуществующихЛистов",КоличествоСуществующихЛистов);	
	СтруктураДанныхЗНА.Вставить("ТаблицаЛистов",ТаблицаЛистов);
	//++Данилова Е.В. 29.08.2025 HELP-6414
	СтруктураДанныхЗНА.Вставить("СодержимоеБлочка",ЗаданиеНаАгрегацию.СодержимоеБлочка.Выгрузить());
	СтруктураДанныхЗНА.Вставить("БлочкиВсего",ЗаданиеНаАгрегацию.БлочкиВсего.Выгрузить());
	//--Данилова Е.В. 29.08.2025 
	
	
	если КоличествоСуществующихЛистов>=СтруктураДанныхЗНА.КоличествоКоробок и ДобавлятьКСуществующим тогда  
		СтруктураВозврата.Ошибки.Добавить("Количество существующих листов больше или равно количеству требуемых. Пересоздайте их заново, воспользовавшись кнопкой очистки листов.");	
	КонецЕсли;   
	//++Данилова Е.В. 05.05.2026 SNL-201 
	РезультатПроверкиКолКодов = ПроверитьКоличествоКодовДляБронирования(СтруктураДанныхЗНА,ДобавлятьКСуществующим); 
	Если НЕ РезультатПроверкиКолКодов.Успех Тогда
		МаркировкаКС.ДобавитьОшибки(СтруктураВозврата,РезультатПроверкиКолКодов);
		возврат СтруктураВозврата;
	КонецЕсли;
	//--Данилова Е.В. 05.05.2026
	РезультатВыполненияСоздатьЛисты = СоздатьЛистыПереукладкиПоЗНА(ЗаданиеНаАгрегацию, СтруктураДанныхЗНА);     	
	если не РезультатВыполненияСоздатьЛисты.Успех тогда  
		МаркировкаКС.ДобавитьОшибки(СтруктураВозврата,РезультатВыполненияСоздатьЛисты);
	КонецЕсли;  
	
	если РезультатВыполненияСоздатьЛисты.Успех тогда 
		СтруктураДанныхЗНА.Вставить("ТаблицаЛистов",ПолучитьТекущиеЛистыПереукладкиПоЗНА(ЗаданиеНаАгрегацию));
		РезультатВыполненияЗаполнитьАгрегации = ЗаполнитьАгрегацииКоробовВЛистахПоЗНА(ЗаданиеНаАгрегацию, СтруктураДанныхЗНА);     	
		если не РезультатВыполненияЗаполнитьАгрегации.Успех тогда  
			МаркировкаКС.ДобавитьОшибки(СтруктураВозврата,РезультатВыполненияЗаполнитьАгрегации);
		КонецЕсли;  
	КонецЕсли;
	
	
	если СтруктураВозврата.Ошибки.Количество()>0 тогда
		СтруктураВозврата.Успех = ложь;   
	КонецЕсли;
	
	возврат СтруктураВозврата;
	
КонецФункции     


Функция СоздатьЛистыПереукладкиПоЗНА (Знач ЗаданиеНаАгрегацию,Знач СтруктураДанныхЗНА)
	СтруктураВозврата = новый Структура("Успех,Ошибки",Истина,новый Массив);
	если СтруктураДанныхЗНА.ЛистыСозданы и не СтруктураДанныхЗНА.ДобавлятьКСуществующим тогда 
		НужноСоздаватьЛисты = ложь;	
	иначе
		НужноСоздаватьЛисты = Истина;
	КонецЕсли;
	
	если НужноСоздаватьЛисты тогда		
		
		
		если СтруктураДанныхЗНА.ДобавлятьКСуществующим тогда   
			НачальныйНомерКоробки = СтруктураДанныхЗНА.КоличествоСуществующихЛистов+1;
		иначе
			НачальныйНомерКоробки = 1;
		КонецЕсли;		                 
		
		ЗаданиеНаАгрегациюОбъект = ЗаданиеНаАгрегацию.ПолучитьОбъект();	 
		ЗаданиеНаАгрегациюОбъект.ЛистыСозданы = ложь;           
		
		попытка
			ЗаданиеНаАгрегациюОбъект.Записать(); 
		Исключение 
			СтруктураВозврата.Ошибки.Добавить("Не удалось записать ЗНА перед созданием листов "+ЗаданиеНаАгрегацию+". "+ОписаниеОшибки());    
			СтруктураВозврата.Успех = ложь;
			возврат СтруктураВозврата;
		КонецПопытки;

		МаксимальныйНомерКоробки = документы.ЛистПереукладки.ПолучитьМаксимальныйНомерКоробкиПоНакладной(СтруктураДанныхЗНА.ДокОснование);
		СквознойНомерКоробки = МаксимальныйНомерКоробки+1;
		
		для сч = НачальныйНомерКоробки по СтруктураДанныхЗНА.КоличествоКоробок цикл         
			ТекущийЛистОбъект = Неопределено;		
			если не СтруктураДанныхЗНА.ДобавлятьКСуществующим  тогда
				если НачальныйНомерКоробки  < СтруктураДанныхЗНА.КоличествоСуществующихЛистов тогда
					ТекущийЛистОбъект = СтруктураДанныхЗНА.ТаблицаЛистов[НачальныйНомерКоробки].Лист.ПолучитьОбъект();   
				КонецЕсли;      
			КонецЕсли; 
			
			если ТекущийЛистОбъект = Неопределено тогда   
				ТекущийЛистОбъект = Документы.ЛистПереукладки.СоздатьДокумент();
			КонецЕсли;                
			
			ЗаполнитьЛистПереукладкиПоЗНА(ТекущийЛистОбъект,СтруктураДанныхЗНА);   	  
			ТекущийЛистОбъект.ДополнительныеСвойства.Вставить("УпрощенныйРежим",Истина);
			//++Данилова Е.В. 05.05.2026 SNL-201 
			//номер коробки заполняется позже   			
			//ТекущийЛистОбъект.НомерКоробки = СквознойНомерКоробки;
			//--Данилова Е.В. 05.05.2026 
			ТекущийЛистОбъект.Проведен = Истина;
			попытка
				ТекущийЛистОбъект.Записать();	      
			Исключение     
				СтруктураВозврата.Ошибки.Добавить("Не удалось записать листы переукладки попробуйте ещё раз");  
				Прервать;
			КонецПопытки;   
			
			СквознойНомерКоробки = СквознойНомерКоробки+1;
		КонецЦикла;    
		
		Если СтруктураВозврата.Ошибки.Количество()=0 тогда		
			ЗаданиеНаАгрегациюОбъект.ЛистыСозданы = Истина;	
			попытка
				ЗаданиеНаАгрегациюОбъект.Записать(); 
			Исключение 
				СтруктураВозврата.Ошибки.Добавить("Не удалось записать ЗНА после создания листов "+ЗаданиеНаАгрегацию+". "+ОписаниеОшибки());  
			КонецПопытки;
		КонецЕсли;                  
		
	КонецЕсли;
	
	если СтруктураВозврата.Ошибки.Количество()>0 тогда
		СтруктураВозврата.Успех = ложь; 
	КонецЕсли;
	
	возврат СтруктураВозврата;
	
КонецФункции

Функция ЗаполнитьАгрегацииКоробовВЛистахПоЗНА (Знач ЗаданиеНаАгрегацию,Знач СтруктураДанныхЗНА)  Экспорт        
	если ложь тогда ЗаданиеНаАгрегацию = документы.ЗаданиеНаАгрегацию.НайтиПоНомеру("");КонецЕсли;
	
	СтруктураВозврата = новый Структура("Успех,Ошибки",Истина,новый Массив);
	ТаблицаЛистов = СтруктураДанныхЗНА.ТаблицаЛистов;
	КоличествоСуществующихЛистов = ТаблицаЛистов.количество();  
	
	если СтруктураДанныхЗНА.АгрегацииЗаполнены тогда 
		НужноЗаполнятьАгрегации = ложь;	
	иначе
		НужноЗаполнятьАгрегации = Истина;
	КонецЕсли;
	
	если НужноЗаполнятьАгрегации тогда
		
		МассивСтрокТребующихАгрегации  = ТаблицаЛистов.НайтиСтроки(новый Структура("КодАгрегации",Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка())); 
		МассивЛистовТребующихАгрегации = новый Массив;		
		
		для каждого ТекСтрока из МассивСтрокТребующихАгрегации цикл
			МассивЛистовТребующихАгрегации.Добавить(ТекСтрока.Лист);		
		КонецЦикла;
		
		//++Данилова Е.В. 29.08.2025 HELP-6414
		ВсегоБлочковНаЛист = 0; 
		Если СтруктураДанныхЗНА.Свойство("БлочкиВсего")
			И СтруктураДанныхЗНА.БлочкиВсего.Количество() > 0  Тогда
			
			ВсегоБлочковНаЛист = СтруктураДанныхЗНА.БлочкиВсего.Итог("Количество"); 	
			
		КонецЕсли;
		ВсегоБлочковНаЛисты = ВсегоБлочковНаЛист * МассивЛистовТребующихАгрегации.Количество(); 
		//--Данилова Е.В. 29.08.2025
		
		РезультатБронирования 			= Документы.МаркировкаТоваровИСМП.ПолучитьТаблицуРанееЗабронированныхКодовАгрегацииДляМассиваЛистов(МассивЛистовТребующихАгрегации,
		СтруктураДанныхЗНА.ДокОснование
		,Перечисления.ТипыШтрихКодов.Коробка);
		//++Данилова Е.В. 29.08.2025 HELP-6414
		РезультатБронированияБлочков = Новый Структура("Успех,Данные,Ошибки",Истина,Новый ТаблицаЗначений, Новый Массив);  
		Если  ВсегоБлочковНаЛисты > 0 Тогда
			
			РезультатБронированияБлочков = Документы.МаркировкаТоваровИСМП.ПолучитьТаблицуРанееЗабронированныхКодовАгрегацииДляМассиваЛистов(МассивЛистовТребующихАгрегации,
			СтруктураДанныхЗНА.ДокОснование
			,Перечисления.ТипыШтрихКодов.Блочок
			,ВсегоБлочковНаЛисты);	
			
		КонецЕсли;
		//--Данилова Е.В. 29.08.2025 
		
		если РезультатБронирования.Успех 
			И РезультатБронированияБлочков.Успех тогда  //Данилова Е.В. 29.08.2025 HELP-6414
			КодыАгрегацииУстановленыВезде = Истина;
			Для Каждого ТекЛист из МассивЛистовТребующихАгрегации цикл
				ТекЛистОбъект		 = ТекЛист.ПолучитьОбъект();
				если ложь тогда ТекЛистОбъект = документы.ЛистПереукладки.СоздатьДокумент();КонецЕсли; 
				СтрокаДанных 	  	 = РезультатБронирования.Данные.Найти(ТекЛист);
				если СтрокаДанных 	 = Неопределено или СтрокаДанных.КодАгрегации = Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка() тогда
					КодыАгрегацииУстановленыВезде = ложь;   
					СтруктураВозврата.Ошибки.добавить("Не удалось получить код агрегации к "+ТекЛист);
					Продолжить;
				КонецЕсли;
				
				ТекЛистОбъект.КодАгрегации = СтрокаДанных.КодАгрегации;
				ТекЛистОбъект.ДополнительныеСвойства.Вставить("УпрощенныйРежим",Истина);
				//++Данилова Е.В. 29.08.2025 HELP-6414
				ТекЛистОбъект.ШтрихкодыУпаковокБлочков.Очистить();
				Если РезультатБронированияБлочков.Данные.Количество() > 0  Тогда
					
					СтрокиШКБл = РезультатБронированияБлочков.Данные.НайтиСтроки(Новый Структура("Лист",ТекЛист)); 	
					
					Для каждого  СтрокаШКБл Из СтрокиШКБл Цикл
						
						СтрокаШКБлочков = ТекЛистОбъект.ШтрихкодыУпаковокБлочков.Добавить(); 		
						СтрокаШКБлочков.ШтрихкодУпаковки = СтрокаШКБл.КодАгрегации; 	
						
					КонецЦикла;	
					 	
					
				КонецЕсли;
				//--Данилова Е.В. 29.08.2025
				попытка
					ТекЛистОбъект.Записать();
				Исключение    
					СтруктураВозврата.Ошибки.добавить("Не удалось записать после получения кода агрегации "+ТекЛист+". "+ОписаниеОшибки());
					Продолжить;
				КонецПопытки;			
			КонецЦикла;   
			
			если СтруктураВозврата.Ошибки.Количество()=0 тогда    
				ЗаданиеНаАгрегациюОбъект   					= ЗаданиеНаАгрегацию.ПолучитьОбъект();
				ЗаданиеНаАгрегациюОбъект.АгрегацииЗаполнены = Истина;                 
				Попытка
					  ЗаданиеНаАгрегациюОбъект.Записать(РежимЗаписиДокумента.Запись);
				Исключение       
					 СтруктураВозврата.Ошибки.добавить("Не удалось записать после получения кода агрегации "+ЗаданиеНаАгрегацию+". "+ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
			
			
		иначе
			МаркировкаКС.ДобавитьОшибки(СтруктураВозврата,РезультатБронирования);
			//++Данилова Е.В. 02.09.2025  HELP-6414
			МаркировкаКС.ДобавитьОшибки(СтруктураВозврата,РезультатБронированияБлочков);
			//--Данилова Е.В. 02.09.2025
		КонецЕсли;
		
	КонецЕсли;
	
	если СтруктураВозврата.Ошибки.Количество()>0 тогда
		СтруктураВозврата.Успех = ложь;  
	КонецЕсли;
	
	возврат СтруктураВозврата;
	
КонецФункции     




Функция ПолучитьТоварыЗНА (ЗаданиеНаАгрегацию)     
	Запрос = новый запрос;    
	запрос.УстановитьПараметр("ЗаданиеНаАгрегацию",ЗаданиеНаАгрегацию);
	запрос.Текст = "ВЫБРАТЬ
	|	ЗаданиеНаАгрегациюТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаданиеНаАгрегациюТовары.Количество) КАК Количество,
	|	ЗаданиеНаАгрегациюТовары.Продукция КАК Продукция
	|ИЗ
	|	Документ.ЗаданиеНаАгрегацию.Товары КАК ЗаданиеНаАгрегациюТовары
	|ГДЕ
	|	ЗаданиеНаАгрегациюТовары.Ссылка = &ЗаданиеНаАгрегацию
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеНаАгрегациюТовары.Номенклатура,
	|	ЗаданиеНаАгрегациюТовары.Продукция";
	возврат запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаполнитьЛистПереукладкиПоЗНА (Лист,СтруктураДанныхЗНА)  
	
	
	если ложь тогда Лист=Документы.ЛистПереукладки.СоздатьДокумент();   КонецЕсли;
	
	если не лист.ЭтоНовый() тогда 
		для каждого Реквизит из Лист.Метаданные().Реквизиты цикл    
			лист[Реквизит.имя]=Неопределено;	
		КонецЦикла;  		
		
		для каждого ТЧ из Лист.Метаданные().ТабличныеЧасти цикл    
			лист[тч.имя].очистить();	
		КонецЦикла;    
	КонецЕсли;
	
	
	Лист.ПометкаУдаления						 = ложь;    
	Лист.Проведен								 = Истина;
	Лист.Автор									 = ПараметрыСеанса.Пользователь;
	Лист.КоличествоДокумента					 = 0;
	Лист.ТипКороба								 = СтруктураДанныхЗНА.ТипКороба;	
	Лист.ОбъемДокумента							 = СтруктураДанныхЗНА.ТипКороба_Объем;	
	Лист.ТипШК									 = Перечисления.ТипыШтрихКодов.Штука;  	
	Лист.Дата									 = ТекущаяДата();
	Лист.ДокОснование							 = СтруктураДанныхЗНА.ДокОснование;
	лист.ЗагруженИзТСД							 = ложь;
	лист.ОтправленНаТСД							 = ложь;
	лист.ЗаданиеНаАгрегацию						 = СтруктураДанныхЗНА.Ссылка;
	лист.КодАгрегации							 = Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка();
	Лист.Сканировщик							 = Справочники.ФизическиеЛица.ПустаяСсылка();
	для каждого СтрТЗ из СтруктураДанныхЗНА.Товары цикл
		СтрТЧ=Лист.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЧ,СтрТЗ);
	КонецЦикла;
	//++Данилова Е.В. 29.08.2025 HELP-6414 
	Если СтруктураДанныхЗНА.Свойство("СодержимоеБлочка") Тогда
	
		Лист.СодержимоеБлочка.Загрузить(СтруктураДанныхЗНА.СодержимоеБлочка); 
	
	КонецЕсли;
	Если СтруктураДанныхЗНА.Свойство("БлочкиВсего") Тогда
	
		Лист.БлочкиВсего.Загрузить(СтруктураДанныхЗНА.БлочкиВсего); 
	
	КонецЕсли;
	//--Данилова Е.В. 29.08.2025
	
	
КонецПроцедуры

Функция ПолучитьТекущиеЛистыПереукладкиПоЗНА (ЗаданиеНаАгрегацию)  экспорт
	
	Запрос = новый запрос;    
	запрос.УстановитьПараметр("ЗаданиеНаАгрегацию",ЗаданиеНаАгрегацию);
	запрос.Текст = "ВЫБРАТЬ
	|	ЛистПереукладки.Ссылка КАК Лист,
	|	ЛОЖЬ КАК Обработано,
	|	ЛистПереукладки.Дата КАК Дата,
	|	ЛистПереукладки.Номер КАК Номер,
	|	ЛистПереукладки.КодАгрегации КАК КодАгрегации
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.Проведен
	|	И ЛистПереукладки.ЗаданиеНаАгрегацию = &ЗаданиеНаАгрегацию
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер";
	возврат запрос.Выполнить().Выгрузить();
	
КонецФункции    

Функция ПолучитьВсеЛистыПереукладкиПоЗНА (ЗаданиеНаАгрегацию)  экспорт
	
	Запрос = новый запрос;    
	запрос.УстановитьПараметр("ЗаданиеНаАгрегацию",ЗаданиеНаАгрегацию);
	запрос.Текст = "ВЫБРАТЬ
	|	ЛистПереукладки.Ссылка КАК Лист,
	|	ЛОЖЬ КАК Обработано,
	|	ЛистПереукладки.Дата КАК Дата,  
	|	ЛистПереукладки.Проведен КАК Проведен,	
	|	ЛистПереукладки.Номер КАК Номер,
	|	ЛистПереукладки.КодАгрегации КАК КодАгрегации
	|ИЗ
	|	Документ.ЛистПереукладки КАК ЛистПереукладки
	|ГДЕ
	|	ЛистПереукладки.ЗаданиеНаАгрегацию = &ЗаданиеНаАгрегацию
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер";
	возврат запрос.Выполнить().Выгрузить();
	
КонецФункции


Функция СгенерироватьНоменклатурноеОписаниеЗадание (ТаблицаНоменклатуры)
	Запрос=новый запрос;
	запрос.Текст=  "ВЫБРАТЬ различные
	|	ТЧ.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура.Код КАК Код
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	запрос.УстановитьПараметр("ТЧ",ТаблицаНоменклатуры);  
	возврат СтрСоединить(запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Код"),"#");
КонецФункции



Функция РаспровестиЗНАПоНакладной (Знач Накладная,РаспроводитьВсеДокументы = ложь,ОписаниеНоменклатурыСтрокой="")  экспорт  
	СтруктураВозврата = новый Структура("Успех,Ошибки",Ложь,новый Массив);
	
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	ЗаданиеНаАгрегацию.Ссылка КАК Ссылка,
	|	ЗаданиеНаАгрегацию.Проведен КАК Проведен
	|ИЗ
	|	Документ.ЗаданиеНаАгрегацию КАК ЗаданиеНаАгрегацию
	|ГДЕ
	|	ЗаданиеНаАгрегацию.ДокОснование = &Накладная
	|	И (ЗаданиеНаАгрегацию.ОписаниеНоменклатурыСтрокой = &ОписаниеНоменклатурыСтрокой
	|			ИЛИ &РаспроводитьВсеДокументы)"; 
	
	запрос.УстановитьПараметр("Накладная",Накладная);
	запрос.УстановитьПараметр("РаспроводитьВсеДокументы",РаспроводитьВсеДокументы);
	запрос.УстановитьПараметр("ОписаниеНоменклатурыСтрокой",ОписаниеНоменклатурыСтрокой);     
	запрос.Выполнить().Выбрать();
	
	Выборка = запрос.Выполнить().Выбрать();
	пока Выборка.Следующий() цикл        
		если выборка.проведен тогда
			ЗНАОбъект = выборка.Ссылка.ПолучитьОбъект();
			ЗНАОбъект.Проведен = ложь;
			попытка
				ЗНАОбъект.Записать();  
			Исключение      
				СтруктураВозврата.Ошибки.Добавить(СтрШаблон("Не удалось записать %1 из-за %2",Выборка.ссылка,ОписаниеОшибки()));  
				Продолжить;
			КонецПопытки;
		КонецЕсли;
		ТЗЛистов = ПолучитьВсеЛистыПереукладкиПоЗНА(Выборка.Ссылка);
		Для каждого СтрТЗ из ТЗЛистов цикл    
			Если не СтрТЗ.Проведен тогда Продолжить;КонецЕсли;
			ЛистОбъект = СтрТЗ.Лист.ПолучитьОбъект();
			ЛистОбъект.КодАгрегации = Неопределено;     
			ЛистОбъект.Проведен = ложь;
			
			попытка
				ЛистОбъект.ПростоЗаписать(); 
			Исключение      
				СтруктураВозврата.Ошибки.Добавить(СтрШаблон("Не удалось записать %1 из-за %2",СтрТЗ.Лист,ОписаниеОшибки()));  
				Продолжить;
			КонецПопытки;		
		КонецЦикла;          
		МассивЛистов = ТЗЛистов.ВыгрузитьКолонку("Лист");
		
		ОперАгрегации = Документы.МаркировкаТоваровИСМП.ПолучитьСоздатьДокАгрегации(Накладная, Перечисления.ТипыШтрихКодов.Коробка);	  
		если ЗначениеЗаполнено(ОперАгрегации) тогда
			Результат = Документы.МаркировкаТоваровИСМП.УбратьМассивЛистовИзПакетнойАгрегации(ОперАгрегации, МассивЛистов);   
			если не Результат.Успех тогда    
				МаркировкаКС.ДобавитьОшибки(СтруктураВозврата,Результат);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;  
	
	если СтруктураВозврата.Ошибки.Количество() = 0 тогда 
		СтруктураВозврата.Успех = Истина;
	КонецЕсли;                           
	возврат СтруктураВозврата;
	
КонецФункции

//++Данилова Е.В. 05.05.2026 SNL-201
Функция ПроверитьКоличествоКодовДляБронирования(СтруктураДанныхЗНА,ДобавлятьКСуществующим)
	СтруктураВозврата = новый Структура("Успех,Ошибки",Истина,новый Массив);
	КоличествоНеобходимыхКоробок = СтруктураДанныхЗНА.КоличествоКоробок;
	Если СтруктураДанныхЗНА.ДобавлятьКСуществующим Тогда
		КоличествоНеобходимыхКоробок = КоличествоНеобходимыхКоробок - СтруктураДанныхЗНА.КоличествоСуществующихЛистов; 	
	КонецЕсли;
	 
	ВсегоБлочковНаЛист = 0;
	Если СтруктураДанныхЗНА.Свойство("БлочкиВсего") И СтруктураДанныхЗНА.БлочкиВсего.Количество() > 0 Тогда

		ВсегоБлочковНаЛист = СтруктураДанныхЗНА.БлочкиВсего.Итог("Количество");

	КонецЕсли;
	ВсегоБлочковНаЛисты = ВсегоБлочковНаЛист * КоличествоНеобходимыхКоробок; 
	Если КоличествоНеобходимыхКоробок  = 0 Тогда
		СтруктураВозврата.Успех = Ложь; 
		СтруктураВозврата.Ошибки.Добавить("Количество необходимых коробов равно 0"); 
		Возврат СтруктураВозврата; 
	КонецЕсли;
	Если ВсегоБлочковНаЛисты > 0 Тогда
		ТипШК = Перечисления.ТипыШтрихКодов.Блочок;
		ОперАгрегацииБлочок = Документы.МаркировкаТоваровИСМП.ПолучитьСоздатьДокАгрегации(СтруктураДанныхЗНА.ДокОснование,
			ТипШК);
		Если Не ЗначениеЗаполнено(ОперАгрегацииБлочок) Тогда
			СтруктураВозврата.Ошибки.Добавить("Не найдена операция маркировки с типом ШК ""Блочок""");
		Иначе 
			КолКодовДоступных =  КоличествоДоступныхКодовДляБронирования(ОперАгрегацииБлочок);
			Если КолКодовДоступных < ВсегоБлочковНаЛисты Тогда
				НеобходимоеКолКодов = ВсегоБлочковНаЛисты - КолКодовДоступных;
				ТипУпаковки=Перечисления.ТипыУпаковок.МультитоварнаяУпаковка;
				ДопПараметры = Новый Структура("Добавлять", Истина);

				РезБронирования = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыАгрегации(ТипШК,
					ТипУпаковки, необходимоеКолКодов, ОперАгрегацииБлочок, ДопПараметры);
				Если РезБронирования.Успешно Тогда
					ОперАгрегацииОбъект = ОперАгрегацииБлочок.ПолучитьОбъект();

					Для Каждого СтрМасс Из РезБронирования.Данные Цикл
						СтрТЧ = ОперАгрегацииОбъект.ШтрихкодыКоробок.Добавить();
						СтрТЧ.ДатаДобавления  = ТекущаяДатаСеанса();
						СтрТЧ.ШтрихкодКоробки = СтрМасс;
					КонецЦикла;
					Попытка
						ОперАгрегацииОбъект.Записать();
					Исключение

						СтруктураВозврата.Ошибки.Добавить("Не удалось заброниваровать короба для агрегации. "
							+ ОписаниеОшибки());
					КонецПопытки;
				Иначе
					СтруктураВозврата.ошибки.добавить(СтрСоединить(РезБронирования.Ошибки, символы.ПС));
				КонецЕсли;

			КонецЕсли;

		КонецЕсли;
		
		
	КонецЕсли; 
	
	ТипШК = Перечисления.ТипыШтрихКодов.Коробка;
	ОперАгрегацииКоробка = Документы.МаркировкаТоваровИСМП.ПолучитьСоздатьДокАгрегации(СтруктураДанныхЗНА.ДокОснование, ТипШК);
	Если Не ЗначениеЗаполнено(ОперАгрегацииКоробка) Тогда
		СтруктураВозврата.Ошибки.Добавить("Не найдена операция маркировки с типом ШК ""Коробка""");
	Иначе
		КолКодовДоступных =  КоличествоДоступныхКодовДляБронирования(ОперАгрегацииКоробка);
		Если КолКодовДоступных < КоличествоНеобходимыхКоробок Тогда
			НеобходимоеКолКодов = КоличествоНеобходимыхКоробок - КолКодовДоступных;
			ТипУпаковки=Перечисления.ТипыУпаковок.МультитоварнаяУпаковка;			
			ДопПараметры = Новый Структура("Добавлять", Истина);
			
			РезБронирования = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыАгрегации(ТипШК,
				ТипУпаковки, необходимоеКолКодов, ОперАгрегацииКоробка, ДопПараметры);
			Если РезБронирования.Успешно Тогда
				ОперАгрегацииОбъект = ОперАгрегацииКоробка.ПолучитьОбъект();

				Для Каждого СтрМасс Из РезБронирования.Данные Цикл
					СтрТЧ = ОперАгрегацииОбъект.ШтрихкодыКоробок.Добавить();
					СтрТЧ.ДатаДобавления  = ТекущаяДатаСеанса();
					СтрТЧ.ШтрихкодКоробки = СтрМасс;
				КонецЦикла;
				Попытка
					ОперАгрегацииОбъект.Записать();
				Исключение

					СтруктураВозврата.Ошибки.Добавить("Не удалось заброниваровать короба для агрегации. "
						+ ОписаниеОшибки());
				КонецПопытки;
			Иначе
				СтруктураВозврата.ошибки.добавить(СтрСоединить(РезБронирования.Ошибки, символы.ПС));
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	СтруктураВозврата.Успех = СтруктураВозврата.Ошибки.Количество() = 0; 
	Возврат СтруктураВозврата; 
КонецФункции

Функция КоличествоДоступныхКодовДляБронирования(ДокМаркировки)
	Запрос = Новый запрос;
	Запрос.Текст= "ВЫБРАТЬ
				  |	ТЧ.НомерСтроки КАК НомерСтроки,
				  |	ТЧ.ШтрихкодКоробки КАК ШтрихкодКоробки,
				  |	ТЧ.ДокументОснование КАК ДокументОснование
				  |ПОМЕСТИТЬ ВТ
				  |ИЗ
				  |	&ШтрихкодыКоробок КАК ТЧ
				  |ГДЕ
				  |	(ТЧ.ДокументОснование = НЕОПРЕДЕЛЕНО)	            
				  |;
				  |
				  |////////////////////////////////////////////////////////////////////////////////
				  |ВЫБРАТЬ различные 
				  |	
				  |	ВТ.ШтрихкодКоробки КАК ШтрихкодКоробки
				  |ИЗ
				  |	ВТ КАК ВТ
				  |
				  |";
	Запрос.УстановитьПараметр("ШтрихкодыКоробок",ДокМаркировки.ШтрихкодыКоробок.выгрузить());
	  
	Возврат Запрос.Выполнить().Выгрузить().Количество(); 
	  
КонецФункции
//--Данилова Е.В. 05.05.2026
